single_spout_bed/fluid-openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-0.075 0.00 -0.0075)
    (-0.005 0.00 -0.0075)
    (-0.005 0.75 -0.0075)
    (-0.075 0.75 -0.0075)
    (-0.075 0.00 +0.0075)
    (-0.005 0.00 +0.0075)
    (-0.005 0.75 +0.0075)
    (-0.075 0.75 +0.0075)

    (-0.005 0.00 -0.0075)
    (+0.005 0.00 -0.0075)
    (+0.005 0.75 -0.0075)
    (-0.005 0.75 -0.0075)
    (-0.005 0.00 +0.0075)
    (+0.005 0.00 +0.0075)
    (+0.005 0.75 +0.0075)
    (-0.005 0.75 +0.0075)

    (+0.005 0.00 -0.0075)
    (+0.075 0.00 -0.0075)
    (+0.075 0.75 -0.0075)
    (+0.005 0.75 -0.0075)
    (+0.005 0.00 +0.0075)
    (+0.075 0.00 +0.0075)
    (+0.075 0.75 +0.0075)
    (+0.005 0.75 +0.0075)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (7 75 1)
    simpleGrading (1 1 1)

    hex (8 9 10 11 12 13 14 15)
    (1 75 1)
    simpleGrading (1 1 1)

    hex (16 17 18 19 20 21 22 23)
    (7 75 1)
    simpleGrading (1 1 1)
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (16 17 21 20)
        );
    }
    spout
    {
        type patch;
        faces
        (
            (8 9 13 12)
        );
    }
    top
    {
        type patch;
        faces
        (
            (2 3 7 6)
            (10 11 15 14)
            (18 19 23 22)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (17 18 22 21)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)

            (12 13 14 15)
            (8 11 10 9)

            (20 21 22 23)
            (16 19 18 17)
        );
    }

    // patches to merge blocks on
    merge0l
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    merge0r
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }
    merge1l
    {
        type patch;
        faces
        (
            (9 10 14 13)
        );
    }
    merge1r
    {
        type patch;
        faces
        (
            (16 20 23 19)
        );
    }
);

mergePatchPairs
(
    (merge0l merge0r)
    (merge1l merge1r)
);


// ************************************************************************* //
